#### 8. Шаблоны оборудования + маркировка
Шаблоны оборудования необходимы для упрощения процесса добавления нового типового оборудования.

1) Cоздание шаблона в WEB-приложении

Перейдите в пункт «Объекты» бокового меню, на вкладку «Шаблоны оборудования». Нажмите кнопку «Создать шаблон». На странице создания шаблона оборудования заполните необходимые поля, а затем сохраните.
![16.png](/attachments/images/16.png)

2) Маркировка оборудования через Мобильное приложение для инженера HubEx

Перейдите в пункт «Приемка и маркировка» бокового меню мобильного приложения инженера. Отсканировав QR-код, произойдет переход на экран маркировки, чтобы связать Ваш QR код с этим оборудованием.
![17.png](/attachments/images/17.png)

  Выбрав пункт «Новое оборудование», отобразится список шаблонов оборудования. Выберите один из созданных ранее шаблонов оборудования, чтобы создать новое оборудование с использованием информации из шаблона. По нажатию на «Продолжить без шаблона» отобразится форма создания нового оборудования с незаполненными полями.

![18.png](/attachments/images/18.png)

  Если же при сканировании QR кода, вы не хотите маркировать ваше оборудование, а просто добавить новое оборудование в систему,  то нажмите на кнопку «Продолжить без маркировки», тогда на экране Вашего смартфона отобразится список шаблонов для создания нового оборудования, а также возможность продолжения без шаблона.

![qr.png](/attachments/images/qr.png)

3) Публикация объекта после маркировки

  Для создания заявок на обслуживание объектов, которые были созданы по шаблону, необходимо сначала опубликовать новый объект.
  Для того, чтобы найти объекты, созданные с помощью маркировки или еще неопубликованные, на вкладке «Объекты» есть специальный фильтр «Доступность объектов», который может отобразить как объекты по которым Вы уже разрешили подавать заявки, так и те по которым вы только планируете разрешить подавать заявки впоследствии.
![фильтр.png](/attachments/images/фильтр.png)
  Чтобы опубликовать оборудование, откройте страницу оборудования и нажмите на кнопку «…», после чего в выпадающем меню выберите пункт «Опубликовать».
![опубликовать.png](/attachments/images/опубликовать.png)
